lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/CH32.cpp
/*
 * Platform_CH32.cpp
 * Copyright (C) 2024-2026 Linar Yusupov
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#if defined(ARDUINO_ARCH_CH32)

#include <SPI.h>
#include <Wire.h>

#if defined(USE_TINYUSB)
#include <Adafruit_TinyUSB.h>
#endif

#include "../system/SoC.h"
#include "../driver/RF.h"
#include "../driver/EEPROM.h"
#include "../driver/LED.h"
#include "../driver/OLED.h"
#include "../driver/Baro.h"
#include "../driver/Sound.h"
#include "../driver/Battery.h"
#include "../protocol/data/NMEA.h"
#include "../protocol/data/GDL90.h"
#include "../protocol/data/D1090.h"

#include <Adafruit_SPIFlash.h>
#include "uCDB.hpp"

// SX127x pin mapping
lmic_pinmap lmic_pins = {
    .nss = SOC_GPIO_PIN_SS,
    .txe = LMIC_UNUSED_PIN,
    .rxe = LMIC_UNUSED_PIN,
    .rst = SOC_GPIO_PIN_RST,
    .dio = {LMIC_UNUSED_PIN, LMIC_UNUSED_PIN, LMIC_UNUSED_PIN},
    .busy = SOC_GPIO_PIN_BUSY,
    .tcxo = LMIC_UNUSED_PIN,
};

#if !defined(EXCLUDE_LED_RING)
// Parameter 1 = number of pixels in strip
// Parameter 2 = Arduino pin number (most are valid)
// Parameter 3 = pixel type flags, add together as needed:
//   NEO_KHZ800  800 KHz bitstream (most NeoPixel products w/WS2812 LEDs)
//   NEO_KHZ400  400 KHz (classic 'v1' (not v2) FLORA pixels, WS2811 drivers)
//   NEO_GRB     Pixels are wired for GRB bitstream (most NeoPixel products)
//   NEO_RGB     Pixels are wired for RGB bitstream (v1 FLORA pixels, not v2)
Adafruit_NeoPixel strip = Adafruit_NeoPixel(PIX_NUM, SOC_GPIO_PIN_LED,
                              NEO_GRB + NEO_KHZ800);
#endif /* EXCLUDE_LED_RING */

#if defined(EXCLUDE_WIFI)
char UDPpacketBuffer[4]; // Dummy definition to satisfy build sequence
#endif /* EXCLUDE_WIFI */

static struct rst_info reset_info = {
  .reason = REASON_DEFAULT_RST,
};

static uint32_t bootCount __attribute__ ((section (".noinit")));
static bool wdt_is_active = false;

static CH32_board_id CH32_board = CH32_WCH_V307V_R1; /* default */

static bool CH32_has_eeprom    = false;
static bool CH32_has_spiflash  = false;
static bool FATFS_is_mounted   = false;
static bool ADB_is_open        = false;

#ifdef UART_MODULE_ENABLED
const PinMap PinMap_UART_TX[] = {
  {PA_9, USART1, CH_PIN_DATA(CH_MODE_OUTPUT_50MHz, CH_CNF_OUTPUT_AFPP, 0, AFIO_NONE)},
  {PD_5, USART2, CH_PIN_DATA(CH_MODE_OUTPUT_50MHz, CH_CNF_OUTPUT_AFPP, 0, AFIO_Remap_USART2_ENABLE)},
  {PD_8, USART3, CH_PIN_DATA(CH_MODE_OUTPUT_50MHz, CH_CNF_OUTPUT_AFPP, 0, AFIO_Partial1Remap_USART3_ENABLE)},
  {NC,   NP,     0}
};

const PinMap PinMap_UART_RX[] = {
  {PA_10, USART1, CH_PIN_DATA(CH_MODE_INPUT, CH_CNF_INPUT_PUPD, PULLUP, AFIO_NONE)},
  {PD_6,  USART2, CH_PIN_DATA(CH_MODE_INPUT, CH_CNF_INPUT_PUPD, PULLUP, AFIO_Remap_USART2_ENABLE)},
  {PD_9,  USART3, CH_PIN_DATA(CH_MODE_INPUT, CH_CNF_INPUT_PUPD, PULLUP, AFIO_Partial1Remap_USART3_ENABLE)},
  {NC,    NP,     0}
};

const PinMap PinMap_UART_RTS[] = {
  {NC, USART1, CH_PIN_DATA(CH_MODE_OUTPUT_50MHz, CH_CNF_OUTPUT_AFPP, 0, AFIO_NONE)},
  {NC, USART2, CH_PIN_DATA(CH_MODE_OUTPUT_50MHz, CH_CNF_OUTPUT_AFPP, 0, AFIO_NONE)},
  {NC, USART3, CH_PIN_DATA(CH_MODE_OUTPUT_50MHz, CH_CNF_OUTPUT_AFPP, 0, AFIO_NONE)},
  {NC,    NP,     0}
};

const PinMap PinMap_UART_CTS[] = {
  {NC, USART1, CH_PIN_DATA(CH_MODE_INPUT, CH_CNF_INPUT_PUPD, PULLUP, AFIO_NONE)},
  {NC, USART2, CH_PIN_DATA(CH_MODE_INPUT, CH_CNF_INPUT_PUPD, PULLUP, AFIO_NONE)},
  {NC, USART3, CH_PIN_DATA(CH_MODE_INPUT, CH_CNF_INPUT_PUPD, PULLUP, AFIO_NONE)},
  {NC,    NP,     0}
};
#endif

HardwareSerial Serial2(USART2);
HardwareSerial Serial3(USART3);

#if defined(USE_SOFTSPI)
SoftSPI RadioSPI(SOC_GPIO_PIN_MOSI, SOC_GPIO_PIN_MISO, SOC_GPIO_PIN_SCK);
SoftSPI FlashSPI(SOC_GPIO_YD_FL_MOSI, SOC_GPIO_YD_FL_MISO, SOC_GPIO_YD_FL_CLK);
#else
SPIClass RadioSPI;
SPIClass FlashSPI;
#endif /* USE_SOFTSPI */

static Adafruit_SPIFlash *SPIFlash = NULL;

static uint32_t spiflash_id = 0;

/// Flash device list count
enum {
  W25Q32JV_INDEX,
  EXTERNAL_FLASH_DEVICE_COUNT
};

static SPIFlash_Device_t possible_devices[] = {
  [W25Q32JV_INDEX] = W25Q32JV_IQ,
};

// file system object from SdFat
FatVolume fatfs;

uCDB<FatVolume, File32> ucdb(fatfs);

#if defined(EXCLUDE_EEPROM)
eeprom_t eeprom_block;
settings_t *settings = &eeprom_block.field.settings;
#else
#if defined(USE_EXT_EEPROM)
JC_EEPROM EEPROM(JC_EEPROM::kbits_64, 1, 64, FT24C64_ADDRESS);
#endif /* USE_EXT_EEPROM */
#endif /* EXCLUDE_EEPROM */

#if defined(USE_TINYUSB)
const char *CH32_Device_Manufacturer = SOFTRF_IDENT;
const char *CH32_Device_Model = "Academy Edition";
const uint16_t CH32_Device_Version = SOFTRF_USB_FW_VERSION;

// USB Mass Storage object
Adafruit_USBD_MSC usb_msc;

// Callback invoked when received READ10 command.
// Copy disk's data to buffer (up to bufsize) and
// return number of copied bytes (must be multiple of block size)
static int32_t CH32_msc_read_cb (uint32_t lba, void* buffer, uint32_t bufsize)
{
  // Note: SPIFLash Bock API: readBlocks/writeBlocks/syncBlocks
  // already include 4K sector caching internally. We don't need to cache it, yahhhh!!
  return SPIFlash->readBlocks(lba, (uint8_t*) buffer, bufsize/512) ? bufsize : -1;
}

// Callback invoked when received WRITE10 command.
// Process data in buffer to disk's storage and
// return number of written bytes (must be multiple of block size)
static int32_t CH32_msc_write_cb (uint32_t lba, uint8_t* buffer, uint32_t bufsize)
{
//  ledOn(SOC_GPIO_LED_USBMSC);

  // Note: SPIFLash Bock API: readBlocks/writeBlocks/syncBlocks
  // already include 4K sector caching internally. We don't need to cache it, yahhhh!!
  return SPIFlash->writeBlocks(lba, buffer, bufsize/512) ? bufsize : -1;
}

// Callback invoked when WRITE10 command is completed (status received and accepted by host).
// used to flush any pending cache.
static void CH32_msc_flush_cb (void)
{
  // sync with flash
  SPIFlash->syncBlocks();

  // clear file system's cache to force refresh
  fatfs.cacheClear();

//  ledOff(SOC_GPIO_LED_USBMSC);
}
#endif /* USE_TINYUSB */

#if defined(ENABLE_RECORDER)
#include <SdFat_Adafruit_Fork.h>

SoftSpiDriver<SOC_GPIO_YD_SD_D0, SOC_GPIO_YD_SD_CMD, SOC_GPIO_YD_SD_CLK> uSD_SPI;

// Speed argument is ignored for software SPI.
#if ENABLE_DEDICATED_SPI
#define SD_CONFIG SdSpiConfig(uSD_SS_pin, DEDICATED_SPI, SD_SCK_MHZ(8), &uSD_SPI)
#else  // ENABLE_DEDICATED_SPI
#define SD_CONFIG SdSpiConfig(uSD_SS_pin, SHARED_SPI, SD_SCK_MHZ(8), &uSD_SPI)
#endif  // ENABLE_DEDICATED_SPI

SdFat uSD;

static bool uSD_is_attached = false;
#endif /* ENABLE_RECORDER */

void CH32_attachInterrupt_func(uint32_t pin, void (*userFunc)(void), int mode)
{
  attachInterrupt(pin, GPIO_Mode_IN_FLOATING, userFunc, EXTI_Mode_Interrupt,
                  mode == RISING  ? EXTI_Trigger_Rising  :
                  mode == FALLING ? EXTI_Trigger_Falling :
                  EXTI_Trigger_Rising_Falling /* CHANGE */ );
}

static void CH32_setup()
{
#if SOC_GPIO_RADIO_LED_TX != SOC_UNUSED_PIN
  pinMode(SOC_GPIO_RADIO_LED_TX, OUTPUT);
  digitalWrite(SOC_GPIO_RADIO_LED_TX, ! LED_STATE_ON);
#endif /* SOC_GPIO_RADIO_LED_TX */
#if SOC_GPIO_RADIO_LED_RX != SOC_UNUSED_PIN
  pinMode(SOC_GPIO_RADIO_LED_RX, OUTPUT);
  digitalWrite(SOC_GPIO_RADIO_LED_RX, ! LED_STATE_ON);
#endif /* SOC_GPIO_RADIO_LED_RX */

  SerialOutput.setRx(SOC_GPIO_PIN_CONS_RX);
  SerialOutput.setTx(SOC_GPIO_PIN_CONS_TX);
  SerialOutput.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);

  Serial_GNSS_In.setRx(SOC_GPIO_PIN_GNSS_RX);
  Serial_GNSS_In.setTx(SOC_GPIO_PIN_GNSS_TX);

#if !defined(USE_SOFTSPI)
  RadioSPI.setMISO(SOC_GPIO_PIN_MISO);
  RadioSPI.setMOSI(SOC_GPIO_PIN_MOSI);
  RadioSPI.setSCLK(SOC_GPIO_PIN_SCK);
#endif /* USE_SOFTSPI */

  Wire.setSCL(SOC_GPIO_PIN_SCL);
  Wire.setSDA(SOC_GPIO_PIN_SDA);

#if defined(USE_TINYUSB)
  USBDevice.setManufacturerDescriptor(CH32_Device_Manufacturer);
  USBDevice.setProductDescriptor(CH32_Device_Model);
  USBDevice.setDeviceVersion(CH32_Device_Version);
#endif /* USE_TINYUSB */

