lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/CH32.cpp
  Wire.begin();
  Wire.beginTransmission(FT24C64_ADDRESS);
  CH32_has_eeprom = (Wire.endTransmission() == 0);
  Wire.end();

  if (CH32_has_eeprom) {
    CH32_board = CH32_YD_V307VCT6;
  }

  /* (Q)SPI flash init */
  Adafruit_FlashTransport_SPI *ft = NULL;

  switch (CH32_board)
  {
    case CH32_YD_V307VCT6:
      pin_function(SOC_GPIO_YD_LED_BLUE,
                   CH_PIN_DATA(CH_MODE_OUTPUT_50MHz, CH_CNF_OUTPUT_PP, 0, 0));
      digitalWriteFast(SOC_GPIO_YD_LED_BLUE, HIGH);

      possible_devices[W25Q32JV_INDEX].supports_qspi        = false;
      possible_devices[W25Q32JV_INDEX].supports_qspi_writes = false;

#if !defined(USE_SOFTSPI)
      FlashSPI.setMISO(SOC_GPIO_YD_FL_MISO);
      FlashSPI.setMOSI(SOC_GPIO_YD_FL_MOSI);
      FlashSPI.setSCLK(SOC_GPIO_YD_FL_CLK);
#endif /* USE_SOFTSPI */

      ft = new Adafruit_FlashTransport_SPI(SOC_GPIO_YD_FL_SS, &FlashSPI);

#if defined(ENABLE_RECORDER)
      {
        int uSD_SS_pin = SOC_GPIO_YD_SD_D3;

#if !defined(USE_SOFTSPI) && SPI_DRIVER_SELECT != 2
        uSD_SPI.setMISO(SOC_GPIO_YD_SD_D0);
        uSD_SPI.setMOSI(SOC_GPIO_YD_SD_CMD);
        uSD_SPI.setSCLK(SOC_GPIO_YD_SD_CLK);
#endif /* USE_SOFTSPI */

        pinMode(uSD_SS_pin, OUTPUT);
        digitalWrite(uSD_SS_pin, HIGH);

        uSD_is_attached = uSD.cardBegin(SD_CONFIG);
      }
#endif /* ENABLE_RECORDER */
      break;

    case CH32_WCH_V307V_R1:
    default:
      break;
  }

  if (ft != NULL) {
    SPIFlash = new Adafruit_SPIFlash(ft);
    CH32_has_spiflash = SPIFlash->begin(possible_devices,
                                        EXTERNAL_FLASH_DEVICE_COUNT);
  }

  hw_info.storage = CH32_has_spiflash ? STORAGE_FLASH : STORAGE_NONE;

#if defined(ENABLE_RECORDER)
  if (uSD_is_attached && uSD.card()->cardSize() > 0) {
    hw_info.storage = (hw_info.storage == STORAGE_FLASH) ?
                      STORAGE_FLASH_AND_CARD : STORAGE_CARD;
  }
#endif /* ENABLE_RECORDER */

  if (CH32_has_spiflash) {
    spiflash_id = SPIFlash->getJEDECID();

#if defined(USE_TINYUSB)
    // Set disk vendor id, product id and revision with string up to 8, 16, 4 characters respectively
    usb_msc.setID(CH32_Device_Manufacturer, "External Flash", "1.0");

    // Set callback
    usb_msc.setReadWriteCallback(CH32_msc_read_cb,
                                 CH32_msc_write_cb,
                                 CH32_msc_flush_cb);

    // Set disk size, block size should be 512 regardless of spi flash page size
    usb_msc.setCapacity(SPIFlash->size()/512, 512);

    // MSC is ready for read/write
    usb_msc.setUnitReady(true);

    usb_msc.begin();
#endif /* USE_TINYUSB */

    FATFS_is_mounted = fatfs.begin(SPIFlash);
  }

#if defined(USE_RADIOLIB)
  lmic_pins.dio[0] = SOC_GPIO_PIN_DIO1;
#endif /* USE_RADIOLIB */

  Serial.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);

#if defined(USE_TINYUSB) && defined(USBCON)
  for (int i=0; i < 40; i++) {if (Serial) break; else delay(100);}
#endif
}

static void CH32_post_init()
{
  {
    Serial.println();
    Serial.println(F("SoftRF Academy Edition Power-on Self Test"));
    Serial.println();
    Serial.flush();

    Serial.print(F("Board: "));
    Serial.println(CH32_board == CH32_YD_V307VCT6 ?
                   "YD CH32V307VCT6" : "WCH CH32V307V-R1");
    Serial.println();
    Serial.flush();

    Serial.print  (F("SPI FLASH JEDEC ID: "));
    Serial.print  (spiflash_id, HEX);
    Serial.println();
    Serial.println();
    Serial.flush();

    Serial.println(F("Built-in components:"));

    Serial.print(F("RADIO   : "));
    Serial.println(hw_info.rf      != RF_IC_NONE        ? F("PASS") : F("FAIL"));
    Serial.print(F("GNSS    : "));
    Serial.println(hw_info.gnss    != GNSS_MODULE_NONE  ? F("PASS") : F("FAIL"));

    Serial.print(F("FLASH   : "));
    Serial.println(hw_info.storage == STORAGE_FLASH_AND_CARD ||
                   hw_info.storage == STORAGE_FLASH     ? F("PASS") : F("N/A"));
    Serial.flush();

    Serial.println();
    Serial.println(F("External components:"));
    Serial.print(F("BARO    : "));
    Serial.println(hw_info.baro    != BARO_MODULE_NONE  ? F("PASS") : F("N/A"));
    Serial.print(F("DISPLAY : "));
    Serial.println(hw_info.display != DISPLAY_NONE      ? F("PASS") : F("N/A"));

    Serial.println();
    Serial.println(F("Power-on Self Test is complete."));
    Serial.println();
    Serial.flush();
  }

#if defined(ENABLE_RECORDER)
  if (CH32_board == CH32_YD_V307VCT6)
  {
    if (!uSD_is_attached) {
      Serial.println(F("WARNING: unable to attach micro-SD card."));
    } else {
      // The number of 512 byte sectors in the card
      // or zero if an error occurs.
      size_t cardSize = uSD.card()->cardSize();

      if (cardSize == 0) {
        Serial.println(F("WARNING: invalid micro-SD card size."));
      } else {
        uint8_t cardType = uSD.card()->type();

        Serial.print(F("SD Card Type: "));
        if(cardType == SD_CARD_TYPE_SD1){
            Serial.println(F("V1"));
        } else if(cardType == SD_CARD_TYPE_SD2){
            Serial.println(F("V2"));
        } else if(cardType == SD_CARD_TYPE_SDHC){
            Serial.println(F("SDHC"));
        } else {
            Serial.println(F("UNKNOWN"));
        }

        Serial.print("SD Card Size: ");
        Serial.print(cardSize / (2 * 1024));
        Serial.println(" MB");
      }
    }
    Serial.println();
  }
#endif /* ENABLE_RECORDER */

  Serial.println(F("Data output device(s):"));

  Serial.print(F("NMEA   - "));
  switch (settings->nmea_out)
  {
    case NMEA_UART       :  Serial.println(F("UART"));    break;
    case NMEA_USB        :  Serial.println(F("USB CDC")); break;
    case NMEA_OFF        :
    default              :  Serial.println(F("NULL"));    break;
  }

  Serial.print(F("GDL90  - "));
  switch (settings->gdl90)
  {
    case GDL90_UART      :  Serial.println(F("UART"));    break;
    case GDL90_USB       :  Serial.println(F("USB CDC")); break;
    case GDL90_OFF       :
    default              :  Serial.println(F("NULL"));    break;
  }

  Serial.print(F("D1090  - "));
  switch (settings->d1090)
  {
    case D1090_UART      :  Serial.println(F("UART"));    break;
    case D1090_USB       :  Serial.println(F("USB CDC")); break;
    case D1090_OFF       :
    default              :  Serial.println(F("NULL"));    break;
  }

  Serial.println();
  Serial.flush();

#if defined(USE_OLED)
  OLED_info1();
#endif /* USE_OLED */
}

static uint32_t prev_tx_packets_counter = 0;
static uint32_t prev_rx_packets_counter = 0;
static unsigned long tx_led_time_marker = 0;
static unsigned long rx_led_time_marker = 0;

#define	LED_BLINK_TIME 100

