lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/CH32.cpp
void CH32_GNSS_PPS_Interrupt_handler() {
  PPS_TimeMarker = millis();
}

static unsigned long CH32_get_PPS_TimeMarker() {
  return PPS_TimeMarker;
}

static bool CH32_Baro_setup() {
  return true;
}

static void CH32_UATSerial_begin(unsigned long baud)
{

}

static void CH32_UATModule_restart()
{

}

static void CH32_WDT_setup()
{
  /* TBD */
}

static void CH32_WDT_fini()
{
  /* TBD */
}

#if SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN
#include <AceButton.h>
using namespace ace_button;

AceButton button_1(SOC_GPIO_PIN_BUTTON);

// The event handler for the button.
void handleEvent(AceButton* button, uint8_t eventType,
    uint8_t buttonState) {

  switch (eventType) {
    case AceButton::kEventClicked:
    case AceButton::kEventReleased:
#if defined(USE_OLED)
      if (button == &button_1) {
        OLED_Next_Page();
      }
#endif
      break;
    case AceButton::kEventDoubleClicked:
      break;
    case AceButton::kEventLongPressed:
      if (button == &button_1) {
        shutdown(SOFTRF_SHUTDOWN_BUTTON);
//      Serial.println(F("This will never be printed."));
      }
      break;
  }
}

/* Callbacks for push button interrupt */
void onPageButtonEvent() {
  button_1.check();
}
#endif /* SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN */

static void CH32_Button_setup()
{
#if SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN
  if (hw_info.model == SOFTRF_MODEL_ACADEMY) {
    int button_pin = SOC_GPIO_PIN_BUTTON;

    // Button(s) uses external pull up resistor.
    pinMode(button_pin, CH32_board == CH32_YD_V307VCT6 ? INPUT_PULLUP : INPUT);

    button_1.init(button_pin);

    // Configure the ButtonConfig with the event handler, and enable all higher
    // level events.
    ButtonConfig* PageButtonConfig = button_1.getButtonConfig();
    PageButtonConfig->setEventHandler(handleEvent);
    PageButtonConfig->setFeature(ButtonConfig::kFeatureClick);
//    PageButtonConfig->setFeature(ButtonConfig::kFeatureDoubleClick);
    PageButtonConfig->setFeature(ButtonConfig::kFeatureLongPress);
    PageButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
//    PageButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterDoubleClick);
//    PageButtonConfig->setFeature(
//                      ButtonConfig::kFeatureSuppressClickBeforeDoubleClick);
//  PageButtonConfig->setDebounceDelay(15);
    PageButtonConfig->setClickDelay(600);
//    PageButtonConfig->setDoubleClickDelay(1500);
    PageButtonConfig->setLongPressDelay(2000);

//  attachInterrupt(digitalPinToInterrupt(button_pin), onPageButtonEvent, CHANGE );
  }
#endif /* SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN */
}

static void CH32_Button_loop()
{
#if SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN
  if (hw_info.model == SOFTRF_MODEL_ACADEMY) {
    button_1.check();
  }
#endif /* SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN */
}

static void CH32_Button_fini()
{
#if SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN
  if (hw_info.model == SOFTRF_MODEL_ACADEMY) {
//  detachInterrupt(digitalPinToInterrupt(SOC_GPIO_PIN_BUTTON));
    while (digitalRead(SOC_GPIO_PIN_BUTTON) == LOW);
    pinMode(SOC_GPIO_PIN_BUTTON, INPUT);
  }
#endif /* SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN */
}

static void CH32_TTS(char *message)
{

}

#if defined(USE_TINYUSB)
static void CH32_USB_setup() {
#if !defined(USBCON)
  USBSerial.begin(SERIAL_OUT_BR);
#endif /* USBCON */
}

static void CH32_USB_loop()  {

}

static void CH32_USB_fini()  {
#if !defined(USBCON)
  USBSerial.end();
#endif /* USBCON */
}

static int CH32_USB_available()
{
  int rval = 0;

  if (USBSerial) {
    rval = USBSerial.available();
  }

  return rval;
}

static int CH32_USB_read()
{
  int rval = -1;

  if (USBSerial) {
    rval = USBSerial.read();
  }

  return rval;
}

static size_t CH32_USB_write(const uint8_t *buffer, size_t size)
{
  size_t rval = size;

  if (USBSerial && (size < USBSerial.availableForWrite())) {
    rval = USBSerial.write(buffer, size);
  }

  return rval;
}

IODev_ops_t CH32_USBSerial_ops = {
  "CH32 USBSerial",
  CH32_USB_setup,
  CH32_USB_loop,
  CH32_USB_fini,
  CH32_USB_available,
  CH32_USB_read,
  CH32_USB_write
};
#endif /* USE_TINYUSB */

const SoC_ops_t CH32_ops = {
  SOC_CH32,
  "CH32",
  CH32_setup,
  CH32_post_init,
  CH32_loop,
  CH32_fini,
  CH32_reset,
  CH32_getChipId,
  CH32_getResetInfoPtr,
  CH32_getResetInfo,
  CH32_getResetReason,
  CH32_getFreeHeap,
  CH32_random,
  CH32_Sound_test,
  CH32_Sound_tone,
  NULL,
  CH32_WiFi_set_param,
  CH32_WiFi_transmit_UDP,
  NULL,
  NULL,
  NULL,
  CH32_EEPROM_begin,
  CH32_EEPROM_extension,
  CH32_SPI_begin,
  CH32_swSer_begin,
  CH32_swSer_enableRx,
  NULL,
#if defined(USE_TINYUSB)
  &CH32_USBSerial_ops,
#else
  NULL,
#endif /* USE_TINYUSB */
  NULL,
  CH32_Display_setup,
  CH32_Display_loop,
  CH32_Display_fini,
  CH32_Battery_setup,
  CH32_Battery_param,
  CH32_GNSS_PPS_Interrupt_handler,
  CH32_get_PPS_TimeMarker,
  CH32_Baro_setup,
  CH32_UATSerial_begin,
  CH32_UATModule_restart,
  CH32_WDT_setup,
  CH32_WDT_fini,
  CH32_Button_setup,
  CH32_Button_loop,
  CH32_Button_fini,
  CH32_TTS,
  NULL
};

#endif /* ARDUINO_ARCH_CH32 */
